program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-tensorflow", "2.17.1"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 224, 224]> input_layer_1) {
            tensor<string, []> input_layer_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_layer_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> functional_1_MobileNetV3Small_1_rescaling_1_Cast_x_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_rescaling_1_Cast_x_to_fp16"), val = tensor<fp16, []>(0x1.01p-7)];
            tensor<fp16, [1, 3, 224, 224]> input_layer_1_to_fp16 = cast(dtype = input_layer_1_to_fp16_dtype_0, x = input_layer_1)[name = tensor<string, []>("cast_5")];
            tensor<fp16, [1, 3, 224, 224]> functional_1_MobileNetV3Small_1_rescaling_1_mul_cast_fp16 = mul(x = input_layer_1_to_fp16, y = functional_1_MobileNetV3Small_1_rescaling_1_Cast_x_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_rescaling_1_mul_cast_fp16")];
            tensor<fp16, []> functional_1_MobileNetV3Small_1_rescaling_1_Cast_1_x_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_rescaling_1_Cast_1_x_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 3, 224, 224]> functional_1_MobileNetV3Small_1_rescaling_1_add_cast_fp16 = add(x = functional_1_MobileNetV3Small_1_rescaling_1_mul_cast_fp16, y = functional_1_MobileNetV3Small_1_rescaling_1_Cast_1_x_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_rescaling_1_add_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 3, 3, 3]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [16]> const_75_to_fp16 = const()[name = tensor<string, []>("const_75_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024)))];
            tensor<fp16, [1, 16, 112, 112]> functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_75_to_fp16, dilations = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_0_to_fp16, x = functional_1_MobileNetV3Small_1_rescaling_1_add_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, []> functional_1_MobileNetV3Small_1_activation_1_Const_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_Const_to_fp16"), val = tensor<fp16, []>(0x1.8p+1)];
            tensor<fp16, [1, 16, 112, 112]> functional_1_MobileNetV3Small_1_activation_1_add_cast_fp16 = add(x = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_activation_1_Const_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_add_cast_fp16")];
            tensor<fp16, [1, 16, 112, 112]> functional_1_MobileNetV3Small_1_activation_1_Relu6_cast_fp16 = relu6(x = functional_1_MobileNetV3Small_1_activation_1_add_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_Relu6_cast_fp16")];
            tensor<fp16, []> ConstantFolding_functional_1_MobileNetV3Small_1_activation_1_truediv_recip_to_fp16 = const()[name = tensor<string, []>("ConstantFolding_functional_1_MobileNetV3Small_1_activation_1_truediv_recip_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 16, 112, 112]> functional_1_MobileNetV3Small_1_activation_1_truediv_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_activation_1_Relu6_cast_fp16, y = ConstantFolding_functional_1_MobileNetV3Small_1_activation_1_truediv_recip_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_truediv_cast_fp16")];
            tensor<fp16, [1, 16, 112, 112]> functional_1_MobileNetV3Small_1_activation_1_mul_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_conv_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_activation_1_truediv_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_mul_cast_fp16")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 16, 113, 113]> pad_4_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_4_pad_0, x = functional_1_MobileNetV3Small_1_activation_1_mul_cast_fp16)[name = tensor<string, []>("pad_4_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_groups_0"), val = tensor<int32, []>(16)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1, 3, 3]> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [16, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp16, [16]> const_76_to_fp16 = const()[name = tensor<string, []>("const_76_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536)))];
            tensor<fp16, [1, 16, 56, 56]> functional_1_MobileNetV3Small_1_expanded_conv_depthwise_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_76_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_1_depthwisex_strides_0, weight = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = pad_4_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_depthwise_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 16, 56, 56]> functional_1_MobileNetV3Small_1_re_lu_1_Relu_cast_fp16 = relu(x = functional_1_MobileNetV3Small_1_expanded_conv_depthwise_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_re_lu_1_Relu_cast_fp16")];
            tensor<bool, []> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_avg_pool_1_Mean_keep_dims_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_avg_pool_1_Mean_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<int32, [2]> const_7 = const()[name = tensor<string, []>("const_7"), val = tensor<int32, [2]>([2, 3])];
            tensor<fp16, [1, 16, 1, 1]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_avg_pool_1_Mean_cast_fp16 = reduce_mean(axes = const_7, keep_dims = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_avg_pool_1_Mean_keep_dims_0, x = functional_1_MobileNetV3Small_1_re_lu_1_Relu_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_avg_pool_1_Mean_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [8, 16, 1, 1]> transpose_4_to_fp16 = const()[name = tensor<string, []>("transpose_4_to_fp16"), val = tensor<fp16, [8, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1664)))];
            tensor<fp16, [8]> const_77_to_fp16 = const()[name = tensor<string, []>("const_77_to_fp16"), val = tensor<fp16, [8]>([0x1.53p-1, -0x1.618p+0, 0x1.e78p-3, 0x1.7bp+1, -0x1.7e8p+0, -0x1.1f4p+1, 0x1.59cp+1, 0x1.91cp+0])];
            tensor<fp16, [1, 8, 1, 1]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_BiasAdd_cast_fp16 = conv(bias = const_77_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_convolutionx_strides_0, weight = transpose_4_to_fp16, x = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_avg_pool_1_Mean_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_BiasAdd_cast_fp16")];
            tensor<fp16, [1, 8, 1, 1]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_relu_1_Relu_cast_fp16 = relu(x = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_BiasAdd_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_relu_1_Relu_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 8, 1, 1]> transpose_6_to_fp16 = const()[name = tensor<string, []>("transpose_6_to_fp16"), val = tensor<fp16, [16, 8, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [16]> const_126_to_fp16 = const()[name = tensor<string, []>("const_126_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2304)))];
            tensor<fp16, [1, 16, 1, 1]> functional_1_MobileNetV3Small_1_Add_cast_fp16 = conv(bias = const_126_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_conv_1_2_convolutionx_strides_0, weight = transpose_6_to_fp16, x = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_relu_1_Relu_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_Add_cast_fp16")];
            tensor<fp16, [1, 16, 1, 1]> functional_1_MobileNetV3Small_1_re_lu_1_2_Relu6_cast_fp16 = relu6(x = functional_1_MobileNetV3Small_1_Add_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_re_lu_1_2_Relu6_cast_fp16")];
            tensor<fp16, []> functional_1_MobileNetV3Small_1_Const_1_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_Const_1_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 16, 1, 1]> functional_1_MobileNetV3Small_1_Mul_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_re_lu_1_2_Relu6_cast_fp16, y = functional_1_MobileNetV3Small_1_Const_1_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_Mul_cast_fp16")];
            tensor<fp16, [1, 16, 56, 56]> functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_mul_1_Mul_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_re_lu_1_Relu_cast_fp16, y = functional_1_MobileNetV3Small_1_Mul_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_mul_1_Mul_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 16, 1, 1]> transpose_8_to_fp16 = const()[name = tensor<string, []>("transpose_8_to_fp16"), val = tensor<fp16, [16, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2432)))];
            tensor<fp16, [16]> const_79_to_fp16 = const()[name = tensor<string, []>("const_79_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3008)))];
            tensor<fp16, [1, 16, 56, 56]> functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_79_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_8_to_fp16, x = functional_1_MobileNetV3Small_1_expanded_conv_squeeze_excite_mul_1_Mul_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 16, 1, 1]> transpose_10_to_fp16 = const()[name = tensor<string, []>("transpose_10_to_fp16"), val = tensor<fp16, [72, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3136)))];
            tensor<fp16, [72]> const_80_to_fp16 = const()[name = tensor<string, []>("const_80_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5504)))];
            tensor<fp16, [1, 72, 56, 56]> functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_80_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_10_to_fp16, x = functional_1_MobileNetV3Small_1_expanded_conv_project_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 72, 56, 56]> functional_1_MobileNetV3Small_1_re_lu_2_1_Relu_cast_fp16 = relu(x = functional_1_MobileNetV3Small_1_expanded_conv_1_expand_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_re_lu_2_1_Relu_cast_fp16")];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 72, 57, 57]> pad_5_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = pad_5_pad_0, x = functional_1_MobileNetV3Small_1_re_lu_2_1_Relu_cast_fp16)[name = tensor<string, []>("pad_5_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_groups_0"), val = tensor<int32, []>(72)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 1, 3, 3]> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [72, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5760)))];
            tensor<fp16, [72]> const_81_to_fp16 = const()[name = tensor<string, []>("const_81_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7168)))];
            tensor<fp16, [1, 72, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_81_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_1_depthwisex_strides_0, weight = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = pad_5_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 72, 28, 28]> functional_1_MobileNetV3Small_1_re_lu_3_1_Relu_cast_fp16 = relu(x = functional_1_MobileNetV3Small_1_expanded_conv_1_depthwise_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_re_lu_3_1_Relu_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 72, 1, 1]> transpose_14_to_fp16 = const()[name = tensor<string, []>("transpose_14_to_fp16"), val = tensor<fp16, [24, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7424)))];
            tensor<fp16, [24]> const_82_to_fp16 = const()[name = tensor<string, []>("const_82_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10944)))];
            tensor<fp16, [1, 24, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_82_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_14_to_fp16, x = functional_1_MobileNetV3Small_1_re_lu_3_1_Relu_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [88, 24, 1, 1]> transpose_16_to_fp16 = const()[name = tensor<string, []>("transpose_16_to_fp16"), val = tensor<fp16, [88, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11072)))];
            tensor<fp16, [88]> const_83_to_fp16 = const()[name = tensor<string, []>("const_83_to_fp16"), val = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15360)))];
            tensor<fp16, [1, 88, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_83_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_16_to_fp16, x = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 88, 28, 28]> functional_1_MobileNetV3Small_1_re_lu_4_1_Relu_cast_fp16 = relu(x = functional_1_MobileNetV3Small_1_expanded_conv_2_expand_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_re_lu_4_1_Relu_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_groups_0"), val = tensor<int32, []>(88)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [88, 1, 3, 3]> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [88, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15616)))];
            tensor<fp16, [88]> const_84_to_fp16 = const()[name = tensor<string, []>("const_84_to_fp16"), val = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17280)))];
            tensor<fp16, [1, 88, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_84_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_1_depthwisex_strides_0, weight = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = functional_1_MobileNetV3Small_1_re_lu_4_1_Relu_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 88, 28, 28]> functional_1_MobileNetV3Small_1_re_lu_5_1_Relu_cast_fp16 = relu(x = functional_1_MobileNetV3Small_1_expanded_conv_2_depthwise_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_re_lu_5_1_Relu_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 88, 1, 1]> transpose_20_to_fp16 = const()[name = tensor<string, []>("transpose_20_to_fp16"), val = tensor<fp16, [24, 88, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17536)))];
            tensor<fp16, [24]> const_85_to_fp16 = const()[name = tensor<string, []>("const_85_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21824)))];
            tensor<fp16, [1, 24, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_85_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_20_to_fp16, x = functional_1_MobileNetV3Small_1_re_lu_5_1_Relu_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 24, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_2_add_1_Add_cast_fp16 = add(x = functional_1_MobileNetV3Small_1_expanded_conv_1_project_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_expanded_conv_2_project_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_2_add_1_Add_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 24, 1, 1]> transpose_22_to_fp16 = const()[name = tensor<string, []>("transpose_22_to_fp16"), val = tensor<fp16, [96, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21952)))];
            tensor<fp16, [96]> const_86_to_fp16 = const()[name = tensor<string, []>("const_86_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26624)))];
            tensor<fp16, [1, 96, 28, 28]> functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_86_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_22_to_fp16, x = functional_1_MobileNetV3Small_1_expanded_conv_2_add_1_Add_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, []> functional_1_MobileNetV3Small_1_activation_1_2_Const_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_2_Const_to_fp16"), val = tensor<fp16, []>(0x1.8p+1)];
            tensor<fp16, [1, 96, 28, 28]> functional_1_MobileNetV3Small_1_activation_1_2_add_cast_fp16 = add(x = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_activation_1_2_Const_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_2_add_cast_fp16")];
            tensor<fp16, [1, 96, 28, 28]> functional_1_MobileNetV3Small_1_activation_1_2_Relu6_cast_fp16 = relu6(x = functional_1_MobileNetV3Small_1_activation_1_2_add_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_2_Relu6_cast_fp16")];
            tensor<fp16, []> ConstantFolding_functional_1_MobileNetV3Small_1_activation_1_2_truediv_recip_to_fp16 = const()[name = tensor<string, []>("ConstantFolding_functional_1_MobileNetV3Small_1_activation_1_2_truediv_recip_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 96, 28, 28]> functional_1_MobileNetV3Small_1_activation_1_2_truediv_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_activation_1_2_Relu6_cast_fp16, y = ConstantFolding_functional_1_MobileNetV3Small_1_activation_1_2_truediv_recip_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_2_truediv_cast_fp16")];
            tensor<fp16, [1, 96, 28, 28]> functional_1_MobileNetV3Small_1_activation_1_2_mul_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_expanded_conv_3_expand_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_activation_1_2_truediv_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_1_2_mul_cast_fp16")];
            tensor<string, []> pad_2_mode_0 = const()[name = tensor<string, []>("pad_2_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_6_pad_0 = const()[name = tensor<string, []>("pad_6_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 96, 31, 31]> pad_6_cast_fp16 = pad(constant_val = const_2_to_fp16, mode = pad_2_mode_0, pad = pad_6_pad_0, x = functional_1_MobileNetV3Small_1_activation_1_2_mul_cast_fp16)[name = tensor<string, []>("pad_6_cast_fp16")];
            tensor<string, []> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_strides_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_groups_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_groups_0"), val = tensor<int32, []>(96)];
            tensor<int32, [4]> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_pad_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 1, 5, 5]> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [96, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26880)))];
            tensor<fp16, [96]> const_87_to_fp16 = const()[name = tensor<string, []>("const_87_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31744)))];
            tensor<fp16, [1, 96, 14, 14]> functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_87_to_fp16, dilations = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_dilations_0, groups = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_groups_0, pad = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_pad_0, pad_type = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_pad_type_0, strides = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_1_depthwisex_strides_0, weight = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = pad_6_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, []> functional_1_MobileNetV3Small_1_activation_2_1_Const_to_fp16 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_2_1_Const_to_fp16"), val = tensor<fp16, []>(0x1.8p+1)];
            tensor<fp16, [1, 96, 14, 14]> functional_1_MobileNetV3Small_1_activation_2_1_add_cast_fp16 = add(x = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_activation_2_1_Const_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_2_1_add_cast_fp16")];
            tensor<fp16, [1, 96, 14, 14]> functional_1_MobileNetV3Small_1_activation_2_1_Relu6_cast_fp16 = relu6(x = functional_1_MobileNetV3Small_1_activation_2_1_add_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_2_1_Relu6_cast_fp16")];
            tensor<fp16, []> ConstantFolding_functional_1_MobileNetV3Small_1_activation_2_1_truediv_recip_to_fp16 = const()[name = tensor<string, []>("ConstantFolding_functional_1_MobileNetV3Small_1_activation_2_1_truediv_recip_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 96, 14, 14]> functional_1_MobileNetV3Small_1_activation_2_1_truediv_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_activation_2_1_Relu6_cast_fp16, y = ConstantFolding_functional_1_MobileNetV3Small_1_activation_2_1_truediv_recip_to_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_2_1_truediv_cast_fp16")];
            tensor<fp16, [1, 96, 14, 14]> functional_1_MobileNetV3Small_1_activation_2_1_mul_cast_fp16 = mul(x = functional_1_MobileNetV3Small_1_expanded_conv_3_depthwise_bn_1_batchnorm_add_1_cast_fp16, y = functional_1_MobileNetV3Small_1_activation_2_1_truediv_cast_fp16)[name = tensor<string, []>("functional_1_MobileNetV3Small_1_activation_2_1_mul_cast_fp16")];
            tensor<bool, []> functional_1_MobileNetV3Small_1_expanded_conv_3_squeeze_excite_avg_pool_1_Mean_keep_dims_0 = const()[name = tensor<string, []>("functional_1_MobileNetV3Small_1_expanded_conv_3_squeeze_excite_avg_pool_1_Mean_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<int32, [2]> const_22 = const()[name = tensor<string, []>("const_22"), val = tensor<int32, [2]>([2, 3])];
